{
  "results": [
    {
      "open": "6.1900",
      "high": "6.1910",
      "low": "5.8400",
      "volume": "1383500.0000",
      "average_volume": "2646464.7012",
      "high_52_weeks": "8.8400",
      "dividend_yield": "0.0000",
      "low_52_weeks": "1.5100",
      "market_cap": "525038400.0000",
      "pe_ratio": null,
      "description": "ImmunoGen, Inc. is a biotechnology company, which develops novel anticancer therapeutics using its antibody-drug conjugate technology. Its product candidates include Mirvetuximab Soravtansine, Coltuximab ravtansine and Kadcyla . The company was founded in March 1981 and is headquartered in Waltham, MA.",
      "instrument": "https://api.robinhood.com/instruments/4df42b1f-8f39-49ae-bbfb-831c43931218/",
      "ceo": "Mark J. Enyedy",
      "headquarters_city": "Waltham",
      "headquarters_state": "Massachusetts",
      "num_employees": 308,
      "year_founded": 1981
    },
    {
      "open": "2.1100",
      "high": "2.2100",
      "low": "2.0600",
      "volume": "2186445.0000",
      "average_volume": "1391280.8526",
      "high_52_weeks": "4.0900",
      "dividend_yield": null,
      "low_52_weeks": "1.4100",
      "market_cap": "340804500.0000",
      "pe_ratio": null,
      "description": "Antares Pharma, Inc. is a pharmaceutical company. The company focuses on the development and commercialization of self-administered parenteral pharmaceutical products and technologies. Its activities include the development of injection devices and injection based pharmaceutical products as well as transdermal gel products. The company was founded in 1979 and is headquartered in Ewing, NJ.",
      "instrument": "https://api.robinhood.com/instruments/e47d02af-3d15-40b4-8e2e-08edab8e7bed/",
      "ceo": "Robert F. Apple",
      "headquarters_city": "Ewing",
      "headquarters_state": "New Jersey",
      "num_employees": 110,
      "year_founded": 1979
    },
    {
      "open": "2.0000",
      "high": "2.0800",
      "low": "2.0000",
      "volume": "1184975.0000",
      "average_volume": "5361139.2143",
      "high_52_weeks": "3.4500",
      "dividend_yield": null,
      "low_52_weeks": "0.7000",
      "market_cap": "622969900.0000",
      "pe_ratio": null,
      "description": "Northern Dynasty Minerals Ltd. engages in the exploration and development of gold and copper mineral properties. It holds interest in Pebble Copper-Gold-Molybdenum Project. The company was founded on May 11, 1983 and is headquartered in Vancouver, Canada.",
      "instrument": "https://api.robinhood.com/instruments/861415a3-003c-4146-b66c-01142bf552b4/",
      "ceo": "Ronald William Thiessen",
      "headquarters_city": "Vancouver",
      "headquarters_state": "British Columbia",
      "num_employees": null,
      "year_founded": 1983
    },
    {
      "open": "33.1300",
      "high": "33.2500",
      "low": "31.8200",
      "volume": "2615306.0000",
      "average_volume": "4850248.1155",
      "high_52_weeks": "46.6900",
      "dividend_yield": null,
      "low_52_weeks": "16.7300",
      "market_cap": "4917852600.0000",
      "pe_ratio": "29.6337",
      "description": "Momo, Inc. operates as a mobile-based social networking platform. The platform includes Momo mobile application and related features, functionalities, tools and services that is provided to users, customers and platform partners. It enables users to establish and expand social relationships based on location and interests. The company was founded by Yan Tang, Yong Li, Xiao Liang Lei and Zhiwei Li on November 23, 2011 and is headquartered in Beijing, China.",
      "instrument": "https://api.robinhood.com/instruments/43da66a3-2e9e-40aa-b831-1a0e7fe7f6e1/",
      "ceo": "Yan Tang",
      "headquarters_city": "Beijing",
      "headquarters_state": "Beijing",
      "num_employees": 924,
      "year_founded": 2011
    },
    {
      "open": "104.9800",
      "high": "105.2900",
      "low": "104.5700",
      "volume": "245300.0000",
      "average_volume": "1810706.7490",
      "high_52_weeks": "107.5300",
      "dividend_yield": null,
      "low_52_weeks": "43.3300",
      "market_cap": "11105266600.0000",
      "pe_ratio": "69.4900",
      "description": "Take-Two Interactive Software, Inc. is a developer, marketer and publisher of interactive entertainment for consumers around the globe. The company develops and publishes products through its two wholly-owned labels Rockstar Games and 2K. Its products are designed for console systems, handheld gaming systems and personal computers, including smart phones and tablets and are delivered through physical retail, digital download, online platforms and cloud streaming services. Take-Two Interactive Software was founded by Ryan A. Brant in 1993 and is headquartered in New York, NY.",
      "instrument": "https://api.robinhood.com/instruments/9fac6c12-bdb8-4420-a85f-52920971e7ba/",
      "ceo": "Strauss H. Zelnick",
      "headquarters_city": "New York",
      "headquarters_state": "New York",
      "num_employees": 3707,
      "year_founded": 1993
    },
    {
      "open": "107.5300",
      "high": "107.7000",
      "low": "106.9700",
      "volume": "1874024.0000",
      "average_volume": "8370078.4940",
      "high_52_weeks": "109.2600",
      "dividend_yield": "0.6771",
      "low_52_weeks": "75.1700",
      "market_cap": "246056492900.0000",
      "pe_ratio": "41.3494",
      "description": "Visa, Inc. is a payments technology company, which connects consumers, merchants, financial institutions, businesses, strategic partners and government entities to electronic payments. The company offers fraud protection for consumers and payment for merchants. It provides pay now with debit, pay ahead with prepaid or pay later with credit products. The company was founded by Hock Dee in 1970 and is headquartered in San Francisco, CA.",
      "instrument": "https://api.robinhood.com/instruments/93495afe-b84b-4664-881c-b6361b0edeef/",
      "ceo": "Alfred F. Kelly, Jr.",
      "headquarters_city": "San Francisco",
      "headquarters_state": "California",
      "num_employees": 12400,
      "year_founded": 1970
    },
    {
      "open": "145.5600",
      "high": "145.7300",
      "low": "144.5800",
      "volume": "1099057.0000",
      "average_volume": "3304558.5578",
      "high_52_weeks": "148.4500",
      "dividend_yield": "0.7651",
      "low_52_weeks": "99.5100",
      "market_cap": "155120460000.0000",
      "pe_ratio": "35.9826",
      "description": "Mastercard, Inc. is a technology company, which engages in the global payments industry that connects consumers, financial institutions, merchants, governments, and business. It offers payment solutions that enables the development and implementation of credit, debit, prepaid, commercial, and payment programs and solutions for consumers and merchants. The company was founded in May 2001 and is headquartered in Purchase, NY.",
      "instrument": "https://api.robinhood.com/instruments/8373dfad-6a18-481e-a6da-b6d754fa7937/",
      "ceo": "Ajay Banga",
      "headquarters_city": "Purchase",
      "headquarters_state": "New York",
      "num_employees": 11900,
      "year_founded": 2001
    },
    {
      "open": "175.4800",
      "high": "175.8800",
      "low": "174.6300",
      "volume": "5643576.0000",
      "average_volume": "18252593.9402",
      "high_52_weeks": "176.7400",
      "dividend_yield": "0.0000",
      "low_52_weeks": "113.5535",
      "market_cap": "507966940000.0000",
      "pe_ratio": "39.8564",
      "description": "Facebook, Inc. engages in the development of social media applications for people to connect through mobile devices, personal computers, and other surfaces. It enables users to share opinions, ideas, photos, videos, and other activities online. Its products include Facebook, Instagram, Messenger, WhatsApp, and Oculus. The company was founded by Mark Elliot Zuckerberg, Dustin Moskovitz, Chris R. Hughes, Andrew McCollum and Eduardo P. Saverin on February 4, 2004 and is headquartered in Menlo Park, CA.",
      "instrument": "https://api.robinhood.com/instruments/ebab2398-028d-4939-9f1d-13bf38f81c50/",
      "ceo": "Mark Elliot Zuckerberg",
      "headquarters_city": "Menlo Park",
      "headquarters_state": "California",
      "num_employees": 17048,
      "year_founded": 2004
    },
    {
      "open": "993.5300",
      "high": "994.6100",
      "low": "982.0000",
      "volume": "931582.0000",
      "average_volume": "3685502.9004",
      "high_52_weeks": "1083.3100",
      "dividend_yield": "0.0000",
      "low_52_weeks": "710.1000",
      "market_cap": "471796800000.0000",
      "pe_ratio": "249.4695",
      "description": "Amazon.com, Inc. engages in the provision of online retail shopping services. It operates through the following segments: North America, International, and Amazon Web Services (AWS). The North America segment includes retail sales of consumer products and subscriptions through North America-focused websites such as www.amazon.com and www.amazon.ca. The International segment offers retail sales of consumer products and subscriptions through internationally-focused websites. The Amazon Web Services segment involves in the global sales of compute, storage, database, and AWS service offerings for start-ups, enterprises, government agencies, and academic institutions. The company was founded by Jeffrey P. Bezos in July 1994 and is headquartered in Seattle, WA.",
      "instrument": "https://api.robinhood.com/instruments/c0bb3aec-bd1e-471e-a4f0-ca011cbec711/",
      "ceo": "Jeffrey P. Bezos",
      "headquarters_city": "Seattle",
      "headquarters_state": "Washington",
      "num_employees": 341400,
      "year_founded": 1994
    },
    {
      "open": "212.1550",
      "high": "212.2800",
      "low": "210.9200",
      "volume": "204250.0000",
      "average_volume": "1593978.2829",
      "high_52_weeks": "214.5300",
      "dividend_yield": "1.0075",
      "low_52_weeks": "144.0000",
      "market_cap": "41315546000.0000",
      "pe_ratio": "27.0173",
      "description": "Constellation Brands, Inc. engages in the production, marketing and distribution of beverage alcohol products. It operates through the following business segments: Beer, Wine \u0026 Spirits, and Corporate Operations \u0026 Other. The Beer segment includes Corona Extra, Corona Light, Modelo Especial, Modelo Negra, Modelo Chelada, Pacifico, and Victoria brands. The Wine \u0026 Spirits segment produces and markets premium wine, including table wine, sparkling wine, and dessert wine; and imports SVEDKA Vodka. The Corporate Operations \u0026 Other segment comprises of traditional corporate-related items, including executive management, corporate development, corporate finance, human resource, internal audit, investor relations, legal, public relation, and information technology. The company was founded by Marvin Sands in 1945 and is headquartered in Victor, NY.",
      "instrument": "https://api.robinhood.com/instruments/4d3a760b-152a-4055-91ba-fd955253f631/",
      "ceo": "Robert S. Sands",
      "headquarters_city": "Victor",
      "headquarters_state": "New York",
      "num_employees": 8700,
      "year_founded": 1945
    },
    {
      "open": "93.8900",
      "high": "94.6200",
      "low": "92.5000",
      "volume": "786665.0000",
      "average_volume": "2501294.8207",
      "high_52_weeks": "94.6600",
      "dividend_yield": "1.9531",
      "low_52_weeks": "59.3800",
      "market_cap": "21580700400.0000",
      "pe_ratio": "49.7184",
      "description": "Microchip Technology, Inc. engages in developing and manufacturing semiconductor products. It operates through the Semiconductor Products and Technology Licensing segments. The Semiconductor Products segment includes designing, developing, manufacturing, and marketing microcontrollers, development tools, and analog, interface, mixed signal, and timing products. The Technology Licensing segment offers license fees and royalties associated with technology licenses for the use of SuperFlash embedded flash and Smartbits one time programmable technologies. The company was founded on February 14, 1989 and is headquartered in Chandler, AZ.",
      "instrument": "https://api.robinhood.com/instruments/c6f91e5b-08c0-40cf-bdba-0f23ffeedf01/",
      "ceo": "Steve Sanghi",
      "headquarters_city": "Chandler",
      "headquarters_state": "Arizona",
      "num_employees": 12656,
      "year_founded": 1989
    },
    {
      "open": "71.6000",
      "high": "71.7700",
      "low": "71.4000",
      "volume": "386207.0000",
      "average_volume": "2992734.3068",
      "high_52_weeks": "72.2200",
      "dividend_yield": "0.9040",
      "low_52_weeks": "55.7200",
      "market_cap": "25201891100.0000",
      "pe_ratio": "14.8592",
      "description": "Tyson Foods, Inc. engages in the production of processed food. It operates through the following segments: Chicken, Beef, Pork and Prepared Foods. The Chicken segment involves in domestic operations related to raising and processing live chickens into fresh, frozen, and value-added chicken products, as well as sales from allied products. The Beef segment includes operations related to processing live fed cattle and fabricating dressed beef carcasses into primal and sub-primal meat cuts and case-ready products. The Pork segment operates with live markets hogs and fabricating pork carcasses into primal and sub-primal cuts and case-ready products. The Prepared Foods segment manufactures and markets frozen and refrigerated food products and logistic operations to move products through the supply chain. The company was founded by John W. Tyson in 1935 and is headquartered in Springdale, AR.",
      "instrument": "https://api.robinhood.com/instruments/f82caa72-16b7-4750-b9bc-cfe8a7518d13/",
      "ceo": "Thomas P. Hayes",
      "headquarters_city": "Springdale",
      "headquarters_state": "Arkansas",
      "num_employees": 114000,
      "year_founded": 1935
    },
    {
      "open": "71.3300",
      "high": "71.7300",
      "low": "69.6900",
      "volume": "17750070.0000",
      "average_volume": "7569290.4143",
      "high_52_weeks": "71.7300",
      "dividend_yield": "0.0000",
      "low_52_weeks": "38.0600",
      "market_cap": "85305940000.0000",
      "pe_ratio": "55.0310",
      "description": "PayPal Holdings, Inc. enables digital and mobile payments on behalf of consumers and merchants worldwide. It provides a simpler and safer way for businesses of all sizes to accept payments from merchant websites, mobile devices and applications, and at offline retail locations through a range of payment solutions. It also facilitates person to person payments through PayPal, Venmo, and Xoom. The company was founded in January 2015 and is headquartered in San Jose, CA.",
      "instrument": "https://api.robinhood.com/instruments/309344d3-af67-4190-9970-b10618959fe5/",
      "ceo": "Daniel H. Schulman",
      "headquarters_city": "San Jose",
      "headquarters_state": "California",
      "num_employees": 18100,
      "year_founded": null
    },
    {
      "open": "184.1400",
      "high": "184.8190",
      "low": "181.2900",
      "volume": "1416002.0000",
      "average_volume": "3470329.9801",
      "high_52_weeks": "191.0999",
      "dividend_yield": "2.7358",
      "low_52_weeks": "133.6400",
      "market_cap": "133688872000.0000",
      "pe_ratio": "16.6773",
      "description": "Amgen, Inc. is a biotechnology medicines company, which discovers, develops, manufactures and markets medicines for grievous illnesses. The company focuses on human therapeutics and concentrates on innovating novel medicines based on advances in cellular and molecular biology. Its products include aranesp, blincyto, corlanor, enbrel, epogen, imlygic, kyprolis, neulasta, neupogen, nplate, parsab, prolia, repatha, sensipar, vectibix, and xgeva. The company was founded by William K. Bowes, Jr., Franklin Pitcher Johnson, Jr., George B. Rathmann and Joseph Rubinfeld on April 8, 1980 and is headquartered in Thousand Oaks, CA.",
      "instrument": "https://api.robinhood.com/instruments/1b007e76-1549-4166-980a-8d9a90931d93/",
      "ceo": "Robert A. Bradway",
      "headquarters_city": "Thousand Oaks",
      "headquarters_state": "California",
      "num_employees": 19200,
      "year_founded": 1980
    },
    {
      "open": "187.1500",
      "high": "188.5900",
      "low": "186.8850",
      "volume": "160822.0000",
      "average_volume": "873308.8008",
      "high_52_weeks": "188.6000",
      "dividend_yield": "2.3704",
      "low_52_weeks": "117.2400",
      "market_cap": "24203400000.0000",
      "pe_ratio": "30.3983",
      "description": "Rockwell Automation, Inc. provides industrial automation power, control and information solutions. The company operates its business through the following segments: Architecture and Software, and Control Products and Solutions. The Architecture and Software segment contains all of the hardware, software and communication components of the company's integrated control and information architecture capable of controlling the customer's industrial processes and connecting with their manufacturing enterprise. The Control Products and Solutions segment combines a comprehensive portfolio of intelligent motor control and industrial control products, application expertise and project management capabilities. Its brands include Allen-Bradley, Rockwell Automation and Rockwell Software. Rockwell Automation business roots back to 1903, when the Allen Bradley was formed. It was founded in 1928 and is headquartered in Milwaukee, WI.",
      "instrument": "https://api.robinhood.com/instruments/ae324050-bc65-4b48-89da-307ef014f1ef/",
      "ceo": "Blake D. Moret",
      "headquarters_city": "Milwaukee",
      "headquarters_state": "Wisconsin",
      "num_employees": 22000,
      "year_founded": 1928
    },
    {
      "open": "62.4800",
      "high": "63.1400",
      "low": "62.2300",
      "volume": "2501778.0000",
      "average_volume": "7278526.6574",
      "high_52_weeks": "66.5800",
      "dividend_yield": "0.7200",
      "low_52_weeks": "35.1200",
      "market_cap": "47274355700.0000",
      "pe_ratio": "42.5986",
      "description": "Activision Blizzard, Inc. engages in the development and publication of interactive entertainment. It operates through the following segments: Activision Publishing, Inc, Blizzard Entertainment, Inc.,  King Digital Entertainment and Other. The Activision Publishing, Inc. segment delivers online games through retail and digital online channels available in personal computer, mobile and table devices, to childrens, adults, and among core games as well as mass-market consumers. The Blizzard Entertainment, Inc. segment provides online personal computer gaming including the subscription-based multiplayer online role-playing game category through the system of subscriptions, retail of physical boxed products, online download sales of personal products and downloading via third-party console. The  King Digital Entertainment  segment distributes its content and services on online social platforms. The Other segment refers to businesses such as Activision Blizzard Media Networks which focuses on eSports industry; the Activision Blizzard Studios which devoted to creating original film and television content based on the library on the company's intellectual properties; and Activision Blizzard Distribution which consists of operations in Europe that provide warehousing, logistical, and sales distribution services to third-party publishers of interactive entertainment software, the company's publishing operations, and manufacturers of interactive entertainment hardware. The company was founded in 1979 and is headquartered in Santa Monica, CA.",
      "instrument": "https://api.robinhood.com/instruments/93ec8a9c-d587-4867-9996-67733ec86980/",
      "ceo": "Robert A. Kotick",
      "headquarters_city": "Santa Monica",
      "headquarters_state": "California",
      "num_employees": 9600,
      "year_founded": 1979
    },
    {
      "open": "198.7200",
      "high": "199.5900",
      "low": "196.5400",
      "volume": "6260751.0000",
      "average_volume": "17886715.6773",
      "high_52_weeks": "199.5900",
      "dividend_yield": "0.4339",
      "low_52_weeks": "66.5750",
      "market_cap": "118173724400.0000",
      "pe_ratio": "55.7677",
      "description": "NVIDIA Corp. designs and manufactures computer graphics processors, chipsets, and related multimedia software. It operates through the following segments: Graphics Processing Unit and Tegra Processor. The Graphics Processing Unit segment includes sales of the company's GeForce discrete and chipset products that supports desktop and notebook PCs plus license fees from Intel and sales of memory products. The Tegra Processors segment provides processors that deliver superior visual and multimedia experience on tablets, smart phones and gaming devices while consuming minimal power. The company was founded by Jen-Hsun Huang, Chris A. Malachowsky and Curtis R. Priem in January 1993 and is headquartered in Santa Clara, CA.",
      "instrument": "https://api.robinhood.com/instruments/a4ecd608-e7b4-4ff3-afa5-f77ae7632dfb/",
      "ceo": "Jen-Hsun Huang",
      "headquarters_city": "Santa Clara",
      "headquarters_state": "California",
      "num_employees": 10299,
      "year_founded": 1993
    },
    {
      "open": "88.7550",
      "high": "89.5400",
      "low": "88.1700",
      "volume": "421405.0000",
      "average_volume": "1134733.6614",
      "high_52_weeks": "104.0700",
      "dividend_yield": null,
      "low_52_weeks": "68.9400",
      "market_cap": "6106784600.0000",
      "pe_ratio": "24.5235",
      "description": "Burlington Stores, Inc. is a holding company, which provides customers the selection of fashionable branded product in women's ready-to-wear apparel, menswear, youth apparel, baby products, footwear, accessories, home goods and coats. The company was founded in 2013 and is headquartered in Burlington, NJ.",
      "instrument": "https://api.robinhood.com/instruments/67214dc8-c1e1-4cd7-8528-a6052d3256c5/",
      "ceo": "Thomas A. Kingsbury",
      "headquarters_city": "Burlington",
      "headquarters_state": "New Jersey",
      "num_employees": 40000,
      "year_founded": 2013
    },
    {
      "open": "16.6900",
      "high": "16.8150",
      "low": "16.6600",
      "volume": "696274.0000",
      "average_volume": "8284027.0837",
      "high_52_weeks": "18.1000",
      "dividend_yield": "0.0000",
      "low_52_weeks": "6.3500",
      "market_cap": "25703558900.0000",
      "pe_ratio": "8.3387",
      "description": "Fiat Chrysler Automobiles NV engages in the design, engineering, manufacturing, distribution and sale of automobiles and light commercial vehicles, engines, transmission systems, automotive-related components, metallurgical products and production systems. It operates through the following segments: North American Free Trade Agreement (NAFTA), Latin America (LATAM), Asia-Pacific (APAC), Europe, the Middle East, and Africa (EMEA), Maserati, and Components. The NAFTA segment engages in the designing, engineering, development, manufacturing, distributing and selling of automobiles under the Chrysler, Jeep, Dodge, Ram and Fiat brand names, vehicles with the SRT performance designation and from sales of the related parts and accessories in the United States, Canada and Mexico. The LATAM segment sells passenger cars and light commercial vehicles and related spare parts under the brand names, Fiat and Fiat in South and Central America and it also provides financial services in Brazil and Argentina. The APAC segment offers cars, engines and transmissions and related spare parts under the Chrysler group and Fiat brands in China, Japan, Australia and India. The EMEA segment designs, develops and sells passenger cars and light commercial vehicles under the Fiat, Alfa Romeo, Lancia, Chrysler, Abarth and Fiat Professional and the sale of the related spare parts in Europe, Middle East and Africa. The Maserati segment manufactures, designs, engineers distribution and sale of luxury vehicles under the Maserati brand. The Components segments includes production and sale of lighting components, body control units, suspensions, shock absorbers, electronic systems, and exhaust systems, and others. The company was founded on April 1, 2014 and is headquartered in London, the United Kingdom.",
      "instrument": "https://api.robinhood.com/instruments/a2a10802-7f80-403f-8c25-52d39b4b4bde/",
      "ceo": "Sergio Marchionne",
      "headquarters_city": "London",
      "headquarters_state": "London \u0026 South East",
      "num_employees": 234499,
      "year_founded": 2014
    },
    {
      "open": "87.0000",
      "high": "87.1300",
      "low": "86.3500",
      "volume": "81498.0000",
      "average_volume": "382635.7849",
      "high_52_weeks": "89.0000",
      "dividend_yield": "2.2559",
      "low_52_weeks": "68.5101",
      "market_cap": "9213421300.0000",
      "pe_ratio": "23.3952",
      "description": "Atmos Energy Corp. is engaged in the regulated natural gas distribution and transmission, and storage businesses as well as other non-regulated natural gas businesses. The company operates its business through three segments: Regulated pipeline, Regulated distribution and Non-regulated. Atmos Energy was founded in 1983 and is headquartered in Dallas, TX.",
      "instrument": "https://api.robinhood.com/instruments/76edc256-cce0-4399-89f5-346708fb5f78/",
      "ceo": "Michael E. Haefner",
      "headquarters_city": "Dallas",
      "headquarters_state": "Texas",
      "num_employees": 4747,
      "year_founded": 1983
    },
    {
      "open": "325.0650",
      "high": "325.8100",
      "low": "319.2500",
      "volume": "326717.0000",
      "average_volume": "1152265.7251",
      "high_52_weeks": "499.0000",
      "dividend_yield": "0.0000",
      "low_52_weeks": "295.1100",
      "market_cap": "9283264600.0000",
      "pe_ratio": "68.5274",
      "description": "Chipotle Mexican Grill, Inc. engages in the development and operation of fast-casual, fresh Mexican food restaurants throughout the U.S. It offers focused menu of burritos, tacos, burrito bowls, and salads, prepared using classic cooking methods. The company was founded by Steve Ells in 1993 and is headquartered in Denver, CO.",
      "instrument": "https://api.robinhood.com/instruments/da53f1f6-29b2-4d20-bb4e-05da9d508259/",
      "ceo": "Steve Ells",
      "headquarters_city": "Denver",
      "headquarters_state": "Colorado",
      "num_employees": 64570,
      "year_founded": 1993
    },
    {
      "open": "20.3574",
      "high": "20.5200",
      "low": "20.1500",
      "volume": "123549.0000",
      "average_volume": "577397.9522",
      "high_52_weeks": "32.5400",
      "dividend_yield": null,
      "low_52_weeks": "18.8400",
      "market_cap": "945152100.0000",
      "pe_ratio": null,
      "description": "e.l.f. Beauty, Inc. is a holding company. It engages in cosmetics and skin-care product. The company sells cosmetics products through retail customers, e.l.f. stores and e-commerce channels. elf Beauty was founded on December 20, 2013 and is headquartered in Oakland, CA.",
      "instrument": "https://api.robinhood.com/instruments/07170c70-b873-4683-b04f-b26e551dc6c4/",
      "ceo": "Tarang P. Amin",
      "headquarters_city": "Oakland",
      "headquarters_state": "California",
      "num_employees": 351,
      "year_founded": 2013
    },
    {
      "open": "37.3600",
      "high": "37.7100",
      "low": "36.6800",
      "volume": "216392.0000",
      "average_volume": "795267.1116",
      "high_52_weeks": "69.4500",
      "dividend_yield": null,
      "low_52_weeks": "36.3600",
      "market_cap": "1271923300.0000",
      "pe_ratio": "26.6086",
      "description": "Synaptics, Inc. engages in the development and supply of custom-designed human interface solutions that enable people to interact with mobile computing, communications, entertainment, and other electronic devices. Its solutions are designed for smartphones, tablets, personal computer, products, primarily notebook computers, and other select electronic devices, including devices in automobiles. The company was founded by Federico Faggin and Carver A. Mead in March 1986 and is headquartered in San Jose, CA.",
      "instrument": "https://api.robinhood.com/instruments/86d9605f-2232-4c17-bdcd-5cba19534c61/",
      "ceo": "Richard A. Bergman",
      "headquarters_city": "San Jose",
      "headquarters_state": "California",
      "num_employees": 1774,
      "year_founded": 1986
    },
    {
      "open": "15.8100",
      "high": "15.9000",
      "low": "15.6350",
      "volume": "1161128.0000",
      "average_volume": "6159334.1514",
      "high_52_weeks": "16.1100",
      "dividend_yield": "3.8462",
      "low_52_weeks": "9.6300",
      "market_cap": "5205774600.0000",
      "pe_ratio": null,
      "description": "Cypress Semiconductor Corp. designs, develops, manufactures and markets a broad range of high-performance solutions for embedded systems, from automotive, industrial and networking platforms to highly interactive consumer devices. Its programmable systems-on-chip, general-purpose microcontrollers, analog ICs, wireless and USB-C based connectivity solutions and memories help engineers design differentiated products. The company operates through the following segments: Microcontroller and Connectivity Division (MCD), and Memory Products Division (MPD). The MCD segment focuses on microcontroller (MCU), analog and wireless and wired connectivity solutions. The portfolio includes Traveo automotive MCUs, PSoC programmable system-on-chip MCUs, ARM Cortex-M4, -M3, -M0+ MCUs and R4 CPUs, analog PMIC Power Management ICs, CapSense capacitive-sensing controllers, TrueTouch touchscreen and fingerprint reader products, Wi-Fi, Bluetooth, Bluetooth Low Energy and ZigBee radios and WICED development platform for the Internet of Things, and USB controllers, including solutions for the USB-C and USB Power Delivery standards. This segment also includes intellectual property foundry business. The MPD segment focuses on parallel and serial NOR flash memories, NAND flash memories, static random access memory, F-RAM ferroelectric memory devices and other specialty memories. Cypress Semiconductor was founded by Thurman John Rodgers in December 1982 and is headquartered in San Jose, CA.",
      "instrument": "https://api.robinhood.com/instruments/cfa64e84-2864-45e7-aac9-fd02e7d1e369/",
      "ceo": "Hassane El-Khoury",
      "headquarters_city": "San Jose",
      "headquarters_state": "California",
      "num_employees": 6546,
      "year_founded": 1982
    },
    {
      "open": "18.4700",
      "high": "18.4950",
      "low": "18.3799",
      "volume": "622561.0000",
      "average_volume": "5825356.9761",
      "high_52_weeks": "18.7200",
      "dividend_yield": "1.5905",
      "low_52_weeks": "12.3000",
      "market_cap": "9127678000.0000",
      "pe_ratio": "43.0744",
      "description": "Marvell Technology Group Ltd. engages in the business of providing semiconductors to high-performance application-specific standard products. It focuses on the development of complex System-on-a-Chip devices leveraging extensive technology portfolio of intellectual property in the areas of analog, mixed-signal, digital signal processing, and embedded and stand alone integrated circuits. Its product portfolio includes devices for data storage, enterprise-class Ethernet data switching, Ethernet physical-layer transceivers, mobile handsets, connectivity and other consumer electronics. The company was founded by Sehat Sutardja, Weili Dai, and Pantas Sutardja in January 1995 and is headquartered in Hamilton, Bermuda.",
      "instrument": "https://api.robinhood.com/instruments/2295a65f-63de-47ec-8f42-90b2ee8bbc74/",
      "ceo": "Matthew J. Murphy",
      "headquarters_city": "Hamilton",
      "headquarters_state": "Hamilton",
      "num_employees": 4617,
      "year_founded": 1995
    },
    {
      "open": "5.0600",
      "high": "5.1200",
      "low": "4.9800",
      "volume": "391483.0000",
      "average_volume": "3007126.3466",
      "high_52_weeks": "12.6500",
      "dividend_yield": "2.5411",
      "low_52_weeks": "4.2400",
      "market_cap": "1559970100.0000",
      "pe_ratio": "9.0744",
      "description": "Tahoe Resources Inc. engages in the acquisition, exploration and development of mineral properties. It operates the Escobal silver mine in Guatemala and La Arena gold mine in Peru and is the Shahuindo project, also in Peru. The company was founded by C. Kevin McArthur on November 10, 2009 and is headquartered in Reno, NV.",
      "instrument": "https://api.robinhood.com/instruments/18c27289-85f0-4f32-9e4c-f6f6452a78c0/",
      "ceo": "Ronald W. Clayton",
      "headquarters_city": "Reno",
      "headquarters_state": "Nevada",
      "num_employees": 2820,
      "year_founded": 2009
    },
    {
      "open": "6.2200",
      "high": "6.3100",
      "low": "6.1200",
      "volume": "3013063.0000",
      "average_volume": "8725235.6175",
      "high_52_weeks": "14.2600",
      "dividend_yield": null,
      "low_52_weeks": "4.9000",
      "market_cap": "1421064000.0000",
      "pe_ratio": null,
      "description": "Fitbit, Inc. engages in the development of wearable device which tracks data of an individual's health. The company offers wrist-based and clippable devices, which can track users daily steps, calories burned, distance traveled and active minutes and display a real-time feedback. Its users also measure floors climbed, sleep duration and quality, and its products track heart rate and GPS-based information such as speed, distance, and exercise routes. Fitbit was founded by Eric N. Friedman \u0026 James Park in March, 2007 and is headquartered in San Francisco, CA.",
      "instrument": "https://api.robinhood.com/instruments/fdf46795-2a81-4506-880f-514c8010c163/",
      "ceo": "James Park",
      "headquarters_city": "San Francisco",
      "headquarters_state": "California",
      "num_employees": 1753,
      "year_founded": 2007
    },
    {
      "open": "209.6500",
      "high": "210.4200",
      "low": "205.4696",
      "volume": "583785.0000",
      "average_volume": "1254482.1673",
      "high_52_weeks": "286.5700",
      "dividend_yield": "0.0000",
      "low_52_weeks": "169.4300",
      "market_cap": "18118988100.0000",
      "pe_ratio": "18.0306",
      "description": "O'Reilly Automotive, Inc. owns and operates retail outlets in the United States. It engages in the distribution and retailing of automotive aftermarket parts, tools, supplies, equipment, and accessories in the U.S., serving both professional installers and do-it-yourself customers. The company provides new and remanufactured automotive hard parts, including alternators, starters, fuel pumps, water pumps, brake system components, batteries, belts, hoses, temperature controls, chassis parts and engine parts; maintenance items comprising oil, antifreeze products, fluids, filters, wiper blades, lighting products, engine additives, and appearance products; and accessories, such as floor mats, seat covers, and truck accessories. Its stores offer auto body paint and related materials, automotive tools and professional service provider service equipment. The company's stores also offer enhanced services and programs comprising used oil, oil filter and battery recycling; battery, wiper, and bulb replacement; battery diagnostic testing; electrical and module testing; check engine light code extraction; loaner tool program; drum and rotor resurfacing; custom hydraulic hoses; professional paint shop mixing and related materials; and machine shops. Its stores provide do-it-yourself and professional service provider customers a selection of brand name, house brands, and private label products for domestic and imported automobiles, vans, and trucks. O'Reilly Automotive was founded by Charles F. O'Reilly and Charles H. O'Reilly, Sr. in November 1957 and is headquartered in Springfield, MO.",
      "instrument": "https://api.robinhood.com/instruments/1c9452ff-cc48-4b43-b744-85566c61eaf8/",
      "ceo": "Gregory L. Henslee",
      "headquarters_city": "Springfield",
      "headquarters_state": "Missouri",
      "num_employees": 74715,
      "year_founded": 1957
    },
    {
      "open": "20.1300",
      "high": "20.3200",
      "low": "20.0450",
      "volume": "463574.0000",
      "average_volume": "2656500.9243",
      "high_52_weeks": "26.8450",
      "dividend_yield": "6.0880",
      "low_52_weeks": "18.4700",
      "market_cap": "2039169000.0000",
      "pe_ratio": "6.0420",
      "description": "GameStop Corp. is a global retailer of multichannel video game, pop culture collectibles, consumer electronics and wireless services. It operates as an omnichannel video game retailer, the AT\u0026T authorized retailer, the Apple certified products reseller, Cricket WirelessTM reseller and the owner of www.thinkgeek.com, sellers of collectible pop culture themed products. The company was founded in June 2000 and is headquartered in Grapevine, TX.",
      "instrument": "https://api.robinhood.com/instruments/2bbdb493-dbb1-4e9c-ac98-6e7c93b117c0/",
      "ceo": "Julian Paul Raines",
      "headquarters_city": "Grapevine",
      "headquarters_state": "Texas",
      "num_employees": 23000,
      "year_founded": 2000
    },
    {
      "open": "31.3100",
      "high": "31.6600",
      "low": "30.9200",
      "volume": "825828.0000",
      "average_volume": "3007673.7769",
      "high_52_weeks": "79.4300",
      "dividend_yield": "1.6174",
      "low_52_weeks": "30.5800",
      "market_cap": "4100808100.0000",
      "pe_ratio": "7.2062",
      "description": "Foot Locker, Inc. engages in the global retail of athletically inspired shoes and apparel. It operates through the following segments: Athletic Stores and Direct-to-Customers. The Athletic Stores segment operates athletic footwear and apparel retailers in the world, with brands that include Foot Locker, Lady Foot Locker, SIX:02, Kids Foot Locker, Champs Sports, Footaction, Runners Point and Sidestep. The Direct-to-Customers segment includes Footlocker.com, Inc. and other affiliates, including Eastbay, Inc., and company's international ecommerce businesses, which sell to customers through their Internet and mobile sites and catalogs. The company was founded in 1989 and is headquartered in New York, NY.",
      "instrument": "https://api.robinhood.com/instruments/bc4181d9-dda3-4e1b-b1c9-1fa3807eb1e2/",
      "ceo": "Richard A. Johnson",
      "headquarters_city": "New York",
      "headquarters_state": "New York",
      "num_employees": 50168,
      "year_founded": 1989
    },
    {
      "open": "52.8200",
      "high": "53.5000",
      "low": "52.7900",
      "volume": "4369170.0000",
      "average_volume": "9472463.2351",
      "high_52_weeks": "60.5300",
      "dividend_yield": "1.3210",
      "low_52_weeks": "49.0100",
      "market_cap": "86859220000.0000",
      "pe_ratio": "22.5787",
      "description": "NIKE, Inc. engages in the design, development, marketing, and sale of athletic footwear, apparel, accessories, equipment, and services. It operates through the following business segments: North America, Western Europe, Central \u0026 Eastern Europe, Greater China, Japan, Emerging Markets, Global Brand Divisions, Converse, and Corporate. The Global Brand Divisions segment represents the Nike brand licensing business. The Converse segment design, market, license, and sell casusal sneakers, apparel and accessories. The Corporate segmeng is consist of foreign currenct hedge gains and losses related to revenues generated by entities within the Nike brand and Converse but managed through the central foreign exchange risk management program of the company. The company was founded by William Jay Bowerman and Philip H. Knight in 1964 and is headquartered in Beaverton, OR.",
      "instrument": "https://api.robinhood.com/instruments/aec9d597-9fdb-4393-af8b-da2019e2c179/",
      "ceo": "Mark G. Parker",
      "headquarters_city": "Beaverton",
      "headquarters_state": "Oregon",
      "num_employees": 74400,
      "year_founded": 1964
    },
    {
      "open": "0.8800",
      "high": "0.8800",
      "low": "0.7359",
      "volume": "753123.0000",
      "average_volume": "82488.3123",
      "high_52_weeks": "103.5000",
      "dividend_yield": "0.0000",
      "low_52_weeks": "0.7359",
      "market_cap": "698200.0000",
      "pe_ratio": null,
      "description": "Rennova Health, Inc. engages in provision of diagnostics and supportive software solutions to healthcare providers. It operates through the following segments: Clinical Laboratory Operations; Supportive Software Solutions; and Decision Support Informatics. The Clinical Laboratory Operations segment provides urine drug toxicology testing to physicians, clinics, and rehabilitation facilities. The Supportive Software Solutions segment offers a customizable Electronic Health Record (EHR) and revenue cycle management services providing a full suite of billing services to substance abuse and behavioral health providers, as well as a dictation-based ambulatory EHR for physician practices and advanced transcription services. The Decision Support and Informatics segment develops and markets medical information and clinical decision support products and services intended to set a standard for the clinical interpretation of genomics-based, precision medicine. The company was founded in December 1989 and is headquartered in West Palm Beach, FL.",
      "instrument": "https://api.robinhood.com/instruments/5ce1b566-f9d3-4d68-98b4-c4fef505e571/",
      "ceo": "Seamus Lagan",
      "headquarters_city": "West Palm Beach",
      "headquarters_state": "Florida",
      "num_employees": 116,
      "year_founded": 1989
    },
    {
      "open": "82.7800",
      "high": "83.1000",
      "low": "82.6200",
      "volume": "2030600.0000",
      "average_volume": "11129240.5538",
      "high_52_weeks": "93.2150",
      "dividend_yield": "3.3016",
      "low_52_weeks": "76.0500",
      "market_cap": "351510299500.0000",
      "pe_ratio": "30.0836",
      "description": "Exxon Mobil Corp. engages in the exploration, development, and distribution of oil, gas, and petroleum products. It operates through the following segments: Upstream, Downstream, and Chemical. The Upstream segment produces crude oil and natural gas. The Downstream segment manufactures and trades petroleum products. The Chemical segment offers petrochemicals. The company was founded by John D. Rockefeller in 1882 and is headquartered in Irving, TX.",
      "instrument": "https://api.robinhood.com/instruments/9133b38b-4917-4b5a-8eab-c029d60f9912/",
      "ceo": "Darren W. Woods",
      "headquarters_city": "Irving",
      "headquarters_state": "Texas",
      "num_employees": 72700,
      "year_founded": 1882
    }
  ]
}
